### Import libraries

In [54]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Import the 'customers' file

In [55]:
path = r'C:\Users\myra_\Documents\Instacart Basket Analysis 02-2023'

In [56]:
# Import the dataset 'customers'
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'))

## Data Wrangling of 'customers'

In [57]:
customers.shape

(206209, 10)

In [58]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Dropping columns

In [59]:
# Dropping columns that we do not need in an analysis
customers_1 = customers.drop(columns=['First Name', 'Surnam'])

### Renaming columns

In [60]:
# Renaming a few columns
customers_1 = customers_1.rename(columns={'STATE': 'state', 'fam_status': 'marital_status', 'Gender': 'gender', 'Age': 'age', 'n_dependants': 'number_of_dependants'})

In [61]:
customers_1.head()

,user_id,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

### Checking for null values

In [62]:
# Checking for missing data in the customers dataset
customers_1.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

There are no missing values in this data

### Changing the data type

In [63]:
customers_1.describe()

             user_id            age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [64]:
# Changing 'user_id' data type from integer to string
customers_1['user_id'] = customers_1['user_id'].astype('str')

In [65]:
customers_1['user_id'].dtype

dtype('O')

The zero depicts that 'user_id' variable is now a string

### Checking for mixed-type columns

In [66]:
for col in customers_1.columns.tolist():
  weird = (customers_1[[col]].applymap(type) != customers_1[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers_1[weird]) > 0:
    print (col)

There are no mixed-type columns since the query did not return anything

### Checking for duplicates

In [67]:
df_dups = customers_1[customers_1.duplicated()]

In [68]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

There are no duplicates in this dataset.

### Exporting customers_1

In [71]:
customers_1.to_pickle(os.path.join(path, '02 Data','Prepared data', 'customers.pkl'))

In [72]:
# The rest of the part 1 task is in script part 1.2 due to memory issues